controllers/SiteController.php

    public function actionView($id)
    {
        $article = Article::findOne($id);
---
SELECT * FROM `article` WHERE `id`='3'